src/InformationRegisters/РодственныеСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РодственныеСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийБонусныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийНакопительныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаЗаконногоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/РодственныеСвязи/Ext/RecordSetModule.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеТребуетсяОбратнаяЗапись") И ДополнительныеСвойства.НеТребуетсяОбратнаяЗапись = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбратнаяЗаписьНабор = РегистрыСведений.РодственныеСвязи.СоздатьНаборЗаписей();
	ОбратнаяЗаписьНабор.ДополнительныеСвойства.Вставить("НеТребуетсяОбратнаяЗапись", Истина);
	ОбратнаяЗаписьНабор.Отбор.Контрагент.Установить(ЭтотОбъект.Отбор.Родственник.Значение);
	ОбратнаяЗаписьНабор.Отбор.Родственник.Установить(ЭтотОбъект.Отбор.Контрагент.Значение);
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		ОбратнаяЗапись					 = ОбратнаяЗаписьНабор.Добавить();
		ОбратнаяЗапись.Контрагент		 = Запись.Родственник;
		ОбратнаяЗапись.Родственник		 = Запись.Контрагент;
		ОбратнаяЗапись.СтепеньРодства	 = Запись.СтепеньРодства;
		ОбратнаяЗапись.СтепеньРодства	 = Справочники.СтепеньРодства.ПолучитьОбратнуюСтепеньРодства(Запись.СтепеньРодства, Запись.Контрагент.ПолКлиента);
		ЗаполнитьЗначенияСвойств(ОбратнаяЗапись, Запись,, "Контрагент, Родственник, СтепеньРодства, ЗаконныйПредставитель");
		
	КонецЦикла;
	
	ОбратнаяЗаписьНабор.Записать();

КонецПроцедуры

#КонецОбласти
